Autodesk.Revit.DB.Architecture.StairsRunType.RiserProfile
The id of the profile of the risers.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid riser profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no riser so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.TreadProfile
The id of the profile of the treads.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid tread profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.NosingProfile
The id of the nosing profile of the treads.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid nosing profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.MaterialId
The material of the stairs run, only available for monolithic stairs run.
The id of the material of the stairs run, invalid ElementId if the stairs run is not monolithic.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The materialId is not a valid material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
Since:
2013